[
    {
      "id": "1",
      "title": "Modern Mythology",
      "author": "Sabine Leitner",
      "content": "Despite their universal existence in all civilizations and all \r\ntimes of history, myths have often been scoffed at and regarded as old wives’ \r\ntales. August Comte, the founder of positivism and sociology, relegated myths to \r\nthe most early and primitive level of intellectual evolution and Lucien \r\nL?vy-Bruhl, a French philosopher, associated myth with pre-logical mentality \r\ncommon to the most primitive stages of mankind. This implies that in our day and \r\nage, we should have long grown out of this “primitive mentality” and should \r\nreject anything that is beyond sense experience and the clear light of reason. \r\n<BR><BR>So how is it possible, then, that myths still capture our imagination, \r\nthat elves and dragons still exert their fascination, that Lord of the Rings was \r\nallegedly, apart from the Bible, the most read book of the 20th century and that \r\nJK Rowling is the best earning author ever in the whole of history? How can it \r\nbe explained that Star Wars has so far inspired 3 generations, that Harry Potter \r\nis enjoyed by children and adults alike, that people are watching films like The \r\nMatrix over and over again and that Lord of the Rings has attracted an \r\nincredibly diverse following across all age groups, from Oxford Professors to \r\nHippies to Middle Class Catholics?<BR><BR> \r\n<h2>The myth is dead – long live the myth!</h2>\r\n Mythology is still alive and always will be. Since the earliest \r\ntimes, man has used symbols and myths to express his experience of a reality \r\nthat transcends the physical world, and to pass it on to future generations. \r\nEvery people in history has had their myths and some of them are still \r\nwell-known today: the Epic ofGilgamesh, the myth of Isis and Osiris, the \r\nMahabharata, the Ramayana, the Heike Monogatari, the Iliad, the Odyssey, Plato’s \r\nmyths, the legends of Saints, the Edda, the Kalevala, the myths of King Arthur \r\nand his knights, the Chanson de Roland and many more. The 19th and the 20th \r\ncenturies saw a steady revival of myths in art, music, literature and film: \r\nWagner’s Ring, Lord of the Rings, Star Wars, the Matrix, Harry Potter, Dune to \r\nname but a few…<BR><BR>This resurgence of mythical elements also led to the \r\ncollection, classification and interpretation of myths and finally to the \r\nestablished study of comparative mythology. <BR><BR>The German anthropologist \r\nAdolph Bastian (1826-1905) was the first to propose the idea that myths from all \r\nover the world seem to be built from the same \"elementary ideas.\" The Swiss \r\npsychiatrist Carl Gustav Jung (1875-1961) named these elementary ideas \r\n\"archetypes,\" which he believed to be the building blocks not only of the \r\nunconscious mind, but of a collective unconscious. Jung believed that all human \r\nbeings are born with the same basic subconscious archetypes such as the ‘hero’ , \r\nthe ‘king’ or the ‘quest’. <br>Complete article on the website...",
      "entrydate": "0000-00-00",
      "image_filename": "Modern_Myth.jpg"
    },
    {
      "id": "2",
      "title": "The Inner Gold of the Alchemists",
      "author": "Julian Scott",
      "content": " Alchemy seems to be an almost universal science. Not only do we \r\nfind it in Medieval Europe, but also in China and India, amongst other places. \r\nThis is perhaps because it is not just a primitive forerunner of modern \r\nchemistry, but a sacred science in its own right, which was studied wherever \r\nesoteric knowledge has appeared.<BR><BR>The first thing I would like to do is to \r\nsweep aside the false image of the bumbling medieval alchemist who tried vainly \r\nto turn lead into gold, as a way of getting rich. If there was not some \r\nsubstance behind alchemy, surely people would not have been so universally \r\nfoolish as to spend the best part of their lives pursuing a mere chimera. \r\n<BR><BR>As in all the magical arts, there are fakes and fools alongside saints \r\nand sages. Alchemy is no exception. But the names of eminent alchemists include \r\nthe greatest scientists and intellects of the Middle Ages. <BR><BR>Although \r\nWestern Alchemy first appeared in late classical times, and probably had its \r\norigin in Egypt (\"Al-Kem\", Kem being the Egyptians' word for Egypt), the first \r\ncited Alchemists appear in the Arab world, from where this science passed to the \r\nWest. One of the most famous Arabian alchemists was Avicenna (980-1037), a man \r\nof immense knowledge and reputation, equivalent to a Plato or Aristotle in \r\nGreece. Extraordinary stories about him abound. It was believed, for example, \r\nthat all the Spirits of the Elements were subject to him. There is also a \r\ntradition that, owing to his knowledge of the Elixir of Life, he still lives, as \r\nan adept who will disclose himself to the profane at the end of a certain cycle. \r\nAt the opposite end of the scale, he was said to have drank so excessively that \r\nhe was sacked from his job as Grand Vizier and died in comparative obscurity. In \r\nview of his enormous literary output and skill as a doctor, this seems rather \r\nunlikely, but the point is this: would such a great scholar and sage have wasted \r\nhis time on a superstition?<BR><BR>In Europe, alchemy is represented by such \r\ntowering figures as Roger Bacon, \"Doctor Mirabilis\", who invented spectacles and \r\npredicted many phenomena such as aeroplanes, microscopes, steam engines and \r\ntelescopes. The long list also includes Paracelsus and John Dee. Both of the \r\nlatter were again extremely powerful minds, John Dee being a genial \r\nmathematician and Paracelsus a brilliant doctor. Such people cannot be dismissed \r\nas charlatans, quacks or eccentrics, because their results speak for themselves. \r\nParacelsus, for example, was once accused of being an impostor and \"not a real \r\ndoctor\". He thereupon challenged his accusers to hand over to him some of their \r\nown \"incurable\" cases. In a very short time he had cured them all, a fact which \r\nwas then testified to by several witnesses at the town hall.<br>Complete article on the website...",
      "entrydate": "0000-00-00",
      "image_filename": "AlchemistsGold.jpg"
    },
    {
      "id": "3",
      "title": "Let's play some Chess",
      "author": "Agostino Dominici",
      "content": "\r\n\r\n<p>Although I have never been a chess player I have always been fascinated by the various elements which constitute this game. Looking at the black and white chess board or the shapes of the various pieces I feel as if something very old and mysterious has been hidden behind those symbols. The origins of this game are not so clear, but it is well known that board games can be found all over the ancient world with records which stretch back as far as 5,000 years ago (i.e. in Egypt). It is very likely that the “ancestor” of this beloved board game was from the East and most likely from India. We also know of its connection with war, military strategies and the Kshatriya (warrior) caste. As India has always been associated with metaphysical teachings I wanted to see what symbolic connections could be found in this game.</p>\r\n\r\n<p>One of the Sanskrit names for chess is Chaturanga, which means, four-limbs or four-membered. In Indian metaphysics the number four is very holy and we find names like : Chaturveda (4 Vedas), Chaturyuga (4 world ages), Chaturvarna (4 castes), etc. There are also references to a four-handed chess called Chaturaji which derives from the word Chaturmaharajikas (4 great kings). This game was played by four players with pieces in four colours (see fig. 1). The pieces included in the four-players chess are: the King, the Elephant (which in the modern chess has become the Bishop), the Horse, the Boat (now the Castle) and the Pawns. </p>\r\n\r\n<p>The arrangement of the pieces reveals the four cardinal directions (East=Green=Spring, South=Red=Summer, West=Black=Autumn and North= White or Yellow=Winter) of the manifested space or the visible world (symbolised by the square-shaped board), where the various “forms” and energies of life (symbolised by the pieces) interact and “play” together the drama of life. Each colour and each cardinal direction is obviously linked to an Element (Fire, Air, Water and Earth) where each group is a host of Elementals headed by its chief Deva (God) or King (see Buddhist mythology of the four kings). The fifth “direction” and its corresponding element (Akasha in Sanskrit) resides in the centre of the board (i.e. fig. 3). Those four groups of pieces can also be interpreted as the four seasons (the pieces were moved in a rotatory direction, analogous to the movement of the sun - starting with the green pieces), the four castes and the four kingdoms of Nature. The movement of the four camps (groups of pieces) symbolizes cyclical transformation and the spinning of the Wheel of Law (Dharmacakra in the Buddhist tradition).</p>\r\n\r\n<p>In a different interpretation, within each coloured group we find again the four elements (Boat/Castle=Earth, Horse=Water, Elephant/Bishop=Air and King=Fire), the four castes (Shudras=Earth, Water=Vaishyas, Air=Brahamins and Fire=Kshatryas) and a fourfold constitution of Man (Earth=Physical, Water=Energetic, Air=Emotional and Fire=Mental). Without going into too much detail, leaving to you the task of working out other interesting correspondences, let us now take a closer look at our “modern” chess (see fig. 2). I put the word “modern” in brackets because it’s not so clear which of the two versions is older, it might well be that the two players chess is even older than the one just described. </p><br>Complete article on the website...",
      "entrydate": "2011-12-28",
      "image_filename": "Play_Chess.jpg"
    },
    {
        "id": "9",
        "title": "The Mozart Effect",
        "author": "David Hirschorn",
        "content": " \"Thus, then, excellence of form and content in discourse and of \r\nmusical expression and rhythm, and grace of form and movement, all depend on \r\ngoodness of nature, by which I mean, not the foolish simplicity sometimes called \r\nby courtesy ‘good nature’, but a nature in which goodness of character has been \r\nwell and truly established.\" (Plato’s Republic, page 89)<BR><BR>Recently, in the \r\nUnited States, the Governor of Georgia asked the state legislature to pass a law \r\nrequiring that a classical CD be sent to every new mother. Although this bill \r\ndid not pass, it received a great deal of attention. The unusual request was \r\nprompted by exciting new research in the fields of neuroscience and cognitive \r\nscience regarding the effects of classical music on intelligence and learning. \r\n<BR>\"It is well known that music facilitates language development, enhances \r\ncreativity and expression in children,\" says Dr. Frances H. Rauscher, of the \r\nCenter for the Neurobiology of Learning and Memory. Dr. Rauscher has conducted \r\nsome of the most innovative research in what several writers have termed \"The \r\nMozart Effect.\" Extensive research on the biological roots of music have \r\nresulted in the following conclusions:<BR><BR>\r\n<OL>\r\n<LI>Music is universal. Studies on the effects of classical music and \r\nintelligence have produced the same favorable results in a variety of cultures. \r\n<LI>Musical behaviors emerge in infancy. Children begin singing very early in \r\nlife, often earlier than speech development. \r\n<LI>Teaching children to play music exercises the brain, the sensory and \r\nperceptual system, and the cognitive system. \r\n<LI>A strong music curriculum improves reading comprehension. This research \r\nstudied students involved in the Kodaly music curriculum. The students were \r\ntested and showed an increase in reading comprehension scores. \r\n<LI>Dramatic long lasting effects of music and intelligence are more pronounced \r\nwhen there is instruction in music. There is not a strong case that casual \r\nlistening has the same effect as instruction in music. However, a study was \r\nconducted in which college students scored eight to nine points higher on a \r\nspatial IQ test after listening to Mozart’s \"Sonata for Two Pianos in D Major\" \r\n(K. 448). (Rauscher, Billboard Magazine) \r\n<LI>Rauscher’s most well-known study involved 34 preschool children who were \r\ngiven piano training for a period of six months. After the six months, the \r\nchildren could play a few basic melodies of Mozart and Beethoven. They exhibited \r\na 36 percent increase in spatial IQ tests. \r\n<LI>This last study received widespread media coverage. Soon after, music stores \r\nbegan selling out of Mozart CD’s, parents began enrolling their children in \r\npiano classes and countless schools and educators began playing Mozart during \r\ninstructional and study time. The \"Mozart Effect\", was labeled as such by \r\ndoctors and scientists and resulted in the popular book of Don Campbell \r\nentitled: The Mozart Effect: Tapping the Power of Music to Heal the Body, \r\nStrengthen the Mind, and Unlock the Creative Spirit.</LI></OL>\r\nCampbell cites \r\nseveral studies on the effects of music on the unborn child. The most important \r\nsound the fetus hears is its mother’s voice. For this reason, it is recommended \r\nthat the mother read to her unborn child. Studies on baby birds show that birds \r\nthat are hatched by foster parents will not sing or imitate the sounds of the \r\nfoster bird-parents that hatched them, only those of their natural \r\nparents.<br>Complete article on the website...",
        "entrydate": "0000-00-00",
        "image_filename": "Beethoven.jpg"
      },    
      {
        "id": "19",
        "title": "Victor Schauberger and the Living Energies of Water",
        "author": "Julian Scott",
        "content": "<p>Victor Schauberger was an Austrian forester of the early to mid-20<sup>th</sup> century, who made some extraordinary discoveries about the nature of water. </p>\r\n\r\n<p>His interest in water began when one day he was watching the water in a river and suddenly found his consciousness being transported by the water, so that he ‘became’ the water and underwent all its experiences. It is an old technique of knowledge, the basis of which is: only by identifying with the object of knowledge can one know it in its essence. It is the opposite of the orthodox scientific approach which is based upon ‘objective’ observation. As Schauberger pointed out, to observe something in the laboratory is often to observe it in a completely artificial setting which would never occur in nature and is therefore false and unreal.</p>\r\n\r\n<p>Here are Schauberger’s own words on the subject: “… running water attracts our consciousness and draws a small part of it along with it in its wake… I realised that one could detach one’s own consciousness from the body and attach it to that of the water. When my consciousness eventually returned, the water’s most deeply concealed psyche often revealed the most extraordinary things to me…”</p>\r\n\r\n<p>When hearing someone speaking of the ‘psyche’ of water, one might be inclined to think the author is slightly unhinged. Indeed, Schauberger was forcibly taken to a psychiatric hospital by the Nazis and was about to be certified as insane, when an influential friend rescued him from an almost certain death. But he was doing no more than assert what all cultures have believed before our own: that nature is a living being, with a body, a soul and a spirit. And within the great body/soul of nature, each of its parts is also a living being similarly endowed. In this sense, the idea of ‘river-gods’ and ‘water-sprites’ would not be the product of primitive fantasy, but the reflection of a reality, which Schauberger and other people of awakened sensitivity have been able to perceive.</p>\r\n\r\n<p>The heart of his discoveries with regard to water is that it moves in an undulating motion, like a snake. You can verify this for yourself by looking at any natural stream: it never travels in a straight line but will always follow a serpentine course. This natural movement allows the great speed of water to be slowed down to manageable proportions so that it does not unduly erode the banks, a fact which you can also verify for yourself by observing any fast flowing water, especially mountain streams. </p>\r\n\r\n<p>He also realised that water is capable of producing some truly remarkable effects, which seem to contradict standard theories of physics. </p><br>Complete article on the website...",
        "entrydate": "2011-12-28",
        "image_filename": "Victor_Schauberger.jpg"
      }
]
  